Examinator/src/Catalogs/ВидыМероприятийСУО/ВидыМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыМероприятийСУО</name>
  <predefined>
    <items>
      <name>НаОсновеЭлектронногоРесурса</name>
      <description>Электронное обучение</description>
    </items>
  </predefined>
  <attributes>
    <name>Общее</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Электронное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПреподаватель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершаетУчащийся</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПрогрессЗавершенияУчащимся</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйБаллЗавершенияУчащимся</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоФайловДляЗавершенияУчастником</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьУчащимсяПрикреплятьФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗапланированного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветАктивного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗавершенного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветОтмененного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРезультатыТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРезультатыТестированияПослеЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьОтветыВРезультатахТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьОценкуВРезультатахТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытьДоступКМатериаламПослеЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданияПроверяютсяВыборочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПодробныеСведенияОЗадании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяИзученияЭлектронныхКурсов</name>
    <type>
      <types>EnumRef.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТекущуюОценку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодчиненное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбязательныеСвойстваУчастников</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/РедакцииВебКабинетаСУ/РедакцииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РедакцииВебКабинетаСУ</name>
  <enumValues>
    <name>Редакция20</name>
  </enumValues>
  <enumValues>
    <name>Редакция30</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ВидыМероприятийСУО/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьЭлементовФормы();	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновленыВидыОбучения",,ЭтотОбъект);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВыставляетсяОценкаПриИзменении(Элемент)
	Если НЕ Объект.ВыставляетсяОценка Тогда
		Объект.ШкалаОценки = Неопределено;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	РасширеннаяФункциональность = ПолучитьФункциональнуюОпцию("РасширеннаяФункциональностьСУО"); 
		
	Если ЗначениеЗаполнено(Объект.ИмяПредопределенныхДанных) Тогда
		Элементы.Общее.ТолькоПросмотр = Истина;
		Элементы.Электронное.ТолькоПросмотр = Истина;			
	КонецЕсли;
	
	Элементы.ДекорацияПредопределенное.Видимость = ЗначениеЗаполнено(Объект.ИмяПредопределенныхДанных);
	Элементы.Общее.Видимость = РасширеннаяФункциональность ИЛИ Объект.Общее;
	
	Если (НЕ ЗначениеЗаполнено(Объект.ШкалаОценки) ИЛИ Объект.ШкалаОценки = Справочники.ШкалыОценокСУО.Двухбалльная)
		И ПолучитьФункциональнуюОпцию("ИспользоватьСлушателейСУО") Тогда		
		Элементы.ШкалаОценки.Видимость = Ложь;		
	Иначе
		Элементы.ШкалаОценки.Видимость = Истина;		
	КонецЕсли;
	
	Элементы.ВремяИзученияЭлектронныхКурсов.Видимость = ВебКабинетСУ.Используется()
		И ВебКабинетСУ.Редакция() = Перечисления.РедакцииВебКабинетаСУ.Редакция30;
	
КонецПроцедуры


#КонецОбласти
